
# tap repositories and their packages

tap 'homebrew/core'
<<<<<<< HEAD
brew 'ca-certificates'
brew 'gdbm'
brew 'mas'
brew 'mpdecimal'
brew 'openssl@1.1'
brew 'python@3.9'
=======
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'romkatv/powerlevel10k'

###########################################################################
#
# SOFTWARE THAT IS TYPICALLY FINE FOR EVERYONE
#
###########################################################################

##
# Browsers
#
# We prefer Firefox because it's open source.
##

# Firefox web browser
cask 'firefox'

# Firefox developer edition, which features programming tools.
cask 'firefox-developer-edition'

# Google Chrome web browser
cask 'google-chrome'

##
# Chat
##

# Discord chat
cask 'discord'

# Slack chat client
#cask 'slack'

##
# Terminals
##

# iTerm is our favorite terminal app.
cask 'iterm2'

##
# Shell
##

# Bash is the Bourne Again SHell. Bash is an sh-compatible shell.
brew 'bash'

# Programmable completion functions for bash
brew 'bash-completion'

# Zsh is a shell designed for interactive use.
brew 'zsh'
brew 'zsh-fast-syntax-highlighting'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'romkatv/powerlevel10k/powerlevel10k'

# Mobile Shell (MOSH) is like SSH plus roaming and smart echo.
brew 'mosh'

##
# Passwords
##

# Keybase.io digital signature manager
cask 'keybase'

# Bitwarden password manager, which is open-source
cask 'bitwarden'

##
# Editors
##

# bat is like `cat` plus line numbers, syntax highlighting, and more.
brew 'bat'

# less is like `more` plus has more capability.
brew 'less'

# most is like `more` plus has more power.
brew 'most'

# Vim editor
brew 'vim'

# Atom editor by GitHub
cask 'atom'

# Sublime text editor
cask 'sublime-text'

# MacTex: LaTeX document preparation system with high-quality typesetting.
cask 'mactex'

##
# Office software
##

# LibreOffice is a large suite of software for documents, spreadsheets, diagrams.
cask 'libreoffice'

# Microsof Office is a large suite of software for documents, spreadsheets, diagrams.
cask "microsoft-office"

##
# Downloaders
##

# Carthage is a simple, decentralized dependency manager for Cocoa.
#brew 'carthage'

# curl is a command line tool for transferring data with URL syntax.
brew 'curl', link: true

# HTTrack is a free and easy-to-use offline browser utility.
#brew 'httrack'

# Wget is a free software package for retrieving files using HTTP and FTP.
brew 'wget'

##
# Version control
##

# Git is a free and open source distributed version control system.
brew 'git'
brew 'svn'

##
# GNU command line tools
#
# If you are moving onto macOS from GNU/Linux, then you would probably
# find out that the command line tools shipped with macOS are not as
# powerful and easy to use as the tools in Linux. The reason is that
# macOS uses the BSD version command line tools, which are different
# from the Linux version.
#
# Note: if you choose to replace the macOS commands with GNU commands,
# then be aware that you may have some compatibility issues with shell
# scripts written specifically for macOS.
#
# If you like using man pages, then you may also want to add an
# itemto the to the MANPATH environmental variable:
#
#     $HOMEBREW_PREFIX/opt/coreutils/libexec/gnuman
#
# For more about the GNU command line tools and brew, see this:
# https://www.topbug.net/blog/2013/04/14/install-and-use-gnu-command-line-tools-in-mac-os-x/
##

# Basic file, shell and text manipulation utilities of the GNU operating system.
#brew 'coreutils'

#brew 'binutils'
#brew 'diffutils'
#brew 'ed'
#brew 'findutils'
#brew 'gawk'
#brew 'gnu-indent'
#brew 'gnu-sed'
#brew 'gnu-tar'
#brew 'gnu-which'
#brew 'gnutls'
#brew 'gzip'
#brew 'watch'
#brew 'wdiff'

##
# Some GNU command line tools already exist by default on OS X.
# We choose to replace these with newer versions.
##

brew 'gdb'  # gdb requires further actions to make it work. See `brew info gdb`.
brew 'gpatch'
brew 'm4'
brew 'make'
brew 'nano'

##
# System related
#
# These are fundamental operating system tools that we use often.
##

# Automake is a tool for automatically generating Makefile installation files.
#brew 'automake'

# GNU Privacy Guard (GnuPG) provides encryption as a free replacement for PGP.
#brew 'gpg'

# GNU Privacy Guard (GnuPG) PIN entry for macOS to do GPG terminal decryption
#brew 'pinentry-mac'

# OpenSSL is an open-source implementation of the SSL and TLS protocols.
brew 'openssl'

# pkg-config is a helper tool used when compiling applications and libraries.
#brew 'pkg-config', link: true

# Functions for use by applications that allow users to edit command lines while typing.
>>>>>>> c2fb172a1b0344dac1d88b8b3db9f193a01c2930
brew 'readline'
brew 'sqlite'
brew 'xz'

<<<<<<< HEAD
tap 'rcmdnk/file'
brew 'brew-file'
=======
# Parallel SSH
#brew 'pssh'

# pkg-config is a helper tool used when compiling applications and libraries.
#brew 'pkg-config'

# PCRE: Perl-compatible regular expressions, for better searching.
#brew 'pcre'
#brew 'pcre++'

# fd: a simple, fast and user-friendly alternative to find.
brew 'fd'

# RPM is the RedHat Package manager.
#brew 'rpm'

# FZF is a command line fuzzy finder.
#brew 'fzf'

# The `z` command to `cd` among directories.
#brew 'zoxide'

# jdupes: detect duplicate files
#brew 'jdupe'

##
# Command line system operator helpers
##

# Navi is a command line cheat sheet navigator
brew 'denisidoro/tools/navi'

# e.g. is a command line examples
brew 'eg-examples'

# TLDR provides simplified and community-driven man pages
brew 'tldr'

# howdoi shows instant coding answers via the command line
brew 'howdoi'

##
# File handling
##

## Compression & decompression

# Zstandard is the best modern compression
brew 'zstd'

# WinRAR provides compression/decompression for RAR and ZIP files.
brew 'unrar'

# unzip is the classic command.
brew 'unzip'

# bzip
brew 'bzip2', link: true

# ZIP file compression
brew 'libzip'

# pp7zip
brew 'p7zip'

# GNU zip
brew 'gzip'

# RPM to CPIO converts a Red Hat RPM package file to a cpio archive
brew 'rpm2cpio'


## Encryption & decryption

# bcrypt is high quality encryption that is very popular
brew 'bcrypt'

# scrypt is high quality encryption
brew 'scrypt'

##
# File synchronization
##

# rsync is the classic unix file synchronizer.
#brew 'rsync'

# Unison is a high-level file synchronization utility.
#brew 'unison'

# Syncthing is open source file sharing.
#brew 'syncthing'

# Dropbox file sharing.
#cask 'dropbox'

# Transmission bittorrent client.
#brew 'transmission-cli'
#cask 'transmission'

# Box.com sync
#cask 'box-sync'

##
# Text search
#
# We prefer ripgrep because it is very fast and very safe.
##

# ripgrep is text search; we prefer it over grep, ag, git grep, ucg, pt, sift.
brew 'ripgrep'

# grep is the classic searcher
brew 'grep'

# jq is a lightweight and flexible command-line JSON processor.
brew 'jq'

# yq is a lightweight and flexible command-line YAML processor.
brew 'yq'

# xsv is for CSV file parsing, and is fast, full featured, and flexible.
brew 'xsv'

# Tad is CSV viewer with features for pivot, search, etc.
cask 'tad'

##
# Chess
##

cask 'scidvsmac'

##
# Cross-platform tooling
#
# These installations tend to be large.
##

##
# Multimedia
##

# Image libraries
brew 'libgphoto2'
brew 'libpng'
brew 'libtiff'

## Multimedia players

# VLC media player
cask 'vlc'

# YT Music player
cask 'ytmdesktop-youtube-music'

## Sound controls

# Airfoil: Wireless audio app with a free sound equalizer (EQ)
#cask 'airfoil'

# eqMac2: System-wide Audio Equalizer for the Mac; free open source
#cask 'eqmac'

# Audio-Hijack: Records audio from any application
cask 'audio-hijack'

# VB-CABLE Virtual Audio Device: Virtual audio cable for routing audio from one application to another
cask 'vb-cable'

## Multimedia editors

# Gimp pixel-based image editor, similar to Adobe Photoshop
cask 'gimp'

# Inkscape vector-based image editor, similar to Adobe Illustrator
#cask 'inkscape'

# Blender 3D modeller
#cask 'blender'

# Shotcut movie editor
cask 'shotcut'

# Freemind mind map editor
#cask 'freemind'

# yEd is desktop application to generate high-quality diagrams
#cask 'yed'

# Multimedia Management
cask 'lunasea'

# Visualization Toolkit for manipulating and displaying scientific data
#brew 'vtk'

## ebooks

# Calibre ebook reader and manager
#cask 'calibre'

# Kindle book reader by Amazon
#cask 'kindle'

# Adobe Air player for multimedia content
#cask 'adobe-air'

## Misc

# GraphicsMagick is the swiss army knife of image processing.
#brew 'graphicsmagick'

# FF MPEG for video
brew 'ffmpeg'
brew 'ffmpeg2theora'
brew 'ffmpegthumbnailer'

# TODO
#brew 'imagemagick'


## Streaming Software

# OBS: Open-source software for live streaming and screen recording
cask 'obs'

# OBS-Websocket: Remote-control OBS Studio through WebSockets
cask 'obs-websocket'

# Touch Portal: Macro remote control
cask 'touch-portal'

##
# Server-Related
##

# Docker software containers to help distribute applications.
brew 'docker'
#brew 'boot2docker'

# Compose is a tool for defining and running multi-container Docker applications.
brew 'docker-compose'

# Docker Machine installs Docker Engine on virtual hosts, and manages the hosts.
#brew 'docker-machine'

##
# Font-Related
##

# Fontconfig is a library for configuring and customizing font access.
brew 'fontconfig'

# FreeType is a freely available software library to render fonts.
brew 'freetype'

# Command-line programs for manipulating fonts
brew 'lcdf-typetools'

##
# Dupes
#
# These formulas duplicate software provided by OS X,
# though may provide more recent or bugfix versions.
#
# We prefer to keep these explicitly listed in `/dupes`
# because these are potentially shadowing system tools,
# and we want to show that these are unusual and special.
#
# If you prefer to type less, then you can tap, like this:
#
#     brew tap homebrew/dupes
#
# Then you can install any forumla, such as:
#
#     brew 'awk'
#
##

brew 'awk'
brew 'diffstat'
brew 'diffutils'
brew 'ed'
brew 'expect'
brew 'fetchmail'
brew 'file-formula'
brew 'gdb'
brew 'gpatch'
brew 'gperf'
brew 'groff'
brew 'heimdal'
brew 'lapack'
brew 'libedit'
brew 'libiconv'
brew 'libpcap'
brew 'lsof'
brew 'm4'
brew 'make'
brew 'nano'
brew 'ncurses'
brew 'openldap'
brew 'openssh'
brew 'tcl-tk'
brew 'tcpdump'
brew 'gnu-units'
brew 'whois'
brew 'zlib'

##
# Brew cask enables installing typical Mac OS X applications.
# For example, these formulas may download a `*.dmg` file,
# then unpack it into the correct `/Applications` directory,
# and possibly configure the app with typical settings.
##

# Adium is an open source multi-protocol instant messaging client.
#cask 'adium'

# TDB
cask 'alfred'

# Window management
cask "rectangle"

# Markdown Presentation in the terminal
brew "slides"

# AppCleaner thoroughly uninstalls unwanted apps.
cask 'appcleaner'

# Flux dims the screen colors for better nighttime visibility.
cask 'flux'

##
# Mac App Store
#
# We use the Mac App Store only when an app is not available
# in a comparable way via brew install and/or brew cask.
#
# We comment out the "mas" commands below, because Apple has
# changed the App Store capability for command line sign in.
#
# Feel free to uncomment any of the below commands that you
# want, try them, and see if you're able to sign in manually.
##

# Apple apps
#mas 'Numbers', id: 409203825
#mas 'Pages', id: 409201541

# Our favorites
#mas "Apple Configurator 2", id: 1037126344
#mas "Blackmagic Disk Speed Test", id: 425264550
#mas "Brightness Slider", id: 456624497
#mas "Color Picker", id: 641027709
#mas "Deliveries", id: 924726344
#mas "Expressions", id: 913158085
#mas "InspectPNG", id: 498851708
#mas "PCalc", id: 403504866
#mas "Pixelmator", id: 407963104
#mas "Telegram", id: 747648890
#mas "Textual", id: 896450579
#mas "Trello", id: 1278508951
#mas "Tweetbot", id: 557168941
#mas 'Simplenote', id: 692867256
#mas 'Sip', id: 507257563
#mas 'Slack', id: 803453959
#mas 'Todoist', id: 585829637

##
# brew-install-our-stacks-automatically.sh
#
# Use Homebrew to install our favorite tech-related packages
# that can be installed fully automatically i.e. unattended;
# these packages do not ask for passwords, do not have any
# prompts, and do not have any issues that need a human.
#
# If you're using this file and you find any packages that
# do not install automatically, please let us know by opening
# an issue, or emailing us, or creating a pull request. Thanks!
#
# ## Link
#
# Some of the brew packages need to link to others.
#
#   * `brew link cmake` before mysql
#   * `brew link cmake` before wireshark can be installed
#   * `brew link cmake` before homebrew/science/opencv
#   * `brew link pandoc` before shellcheck can be installed
#
##

##
# Environment
##


##
# Shell
##

##
# Clients
##

##
# Languages
##

##
# Mac programming
##

# Tunnelblick remote access VPN
cask 'tunnelblick'

##
# Networking
##

# Netcat is a networking utility for the TCP/IP protocol.
# brew 'netcat'

# prettyping: ping with colorful output and progress bars
# brew 'prettyping'

# mtr: a better tool for ping and traceroute
# brew 'mtr'

# Wireshark network monitoring, with the QT GUI.
# brew 'cmake', link: true

# Wireshark-chmodbft enables regular users to capture network packets.
# Use this for typical macOS behaviors; use this insted of 'wireshark'.
# cask 'wireshark-chmodbpf'

# Charles web debugging proxy
# cask 'charles'

# Siege is an http load testing and benchmarking utility.
# brew 'siege'

# nmap network mapper is a security scanner
# brew 'nmap'

# Certbot: automatically enable HTTPS on your website via Let's Encrypt
# brew 'certbot'

##
# Markup languages
#
# For example this section is a good place for HTML tools,
# Markdown tools, UML tools, XML tools, and similar.
##

# Pandoc converts among various formats, such as Markdown and HTML
brew 'pandoc'

## LaTex app that comes with lua(la)tex engines
cask 'TeXShop'

## Markdown

# MacDown simple markdown editor
# cask 'macdown'

# MarkText free open source markdown editor
cask 'mark-text'


###########################################################################
#
# SOFTWARE THAT IS ESPECIALLY SUITABLE FOR DEVELOPERS
#
###########################################################################

##
# IDEs: Integrated Development Environments
##

##
# Tooling
##

# Shared Compilation Cache
brew 'sccache'

##
# Databases
#
# This section installs many databases and database tooling:
# Cassandra, CouchDB, MySQL, PostgreSQL, RabbitMQ, Redis
# Riak, Sphinx, SQLite.
##

# Cassandra database.
#brew 'cassandra'

# CouchDB database, esp. for document-oriented storage.
#brew 'couchdb'

# Hadoop database.
#brew 'hadoop' # Disbled because it interferes with 'yarn'

# MariaDB database
#brew 'mariadb'  # Disabled because it interferes with 'mysql' and 'percona'

# MySQL dadtabase.
#brew 'mysql'

# Memcached data cachce server..
#brew 'libmemcached'
#brew 'memcached'

# PostgreSQL database.
#brew 'postgresql'

# DBeaver database manager, community edition
#cask 'dbeaver-community'

# Postgres commmand line interface (CLI) with autocomplete
#brew 'pgcli'

# Prisma replaces traditional ORMs and adds GraphQL
#tap 'prisma/prisma'
#brew 'prisma'

# RabbitMQ enterprise message queue based on the emerging AMQP standard.
#brew 'rabbitmq'

# Redis database, esp. for key-value cache and store, and data structures.
#brew 'redis', restart_service: true

# Riak open-source distributed database.
#brew 'riak'

# SQLite database: self-contained, serverless, zero-configuration, transactional engine.
#brew 'sqlite', link: true

# ZeroMQ message queue
#brew 'zeromq'

##
# Database searchers
##

# Sphinx search engine, which runs on top of MySQL and/or PostgreSQL.
#brew 'cmake', link: true
#brew 'postgresql'
#brew 'sphinx'

# Xapian is an open-source search engine library.
#brew 'xapian'

# Miller is like awk, sed, cut, join, sort for data, CSV, TSV, etc.
#brew 'miller'

##
# Database managers
##

# Liquibase database migration tool
#brew 'liquibase'

# Realm browser mobile database editor.
#cask 'realm-browser'

# Sequel Pro database management application.
#cask 'sequel-pro'

# Realm browser for the Realm embedded database
#cask 'realm-browser'

# Valentina Studio database manager.
#cask 'valentina-studio'

##
# Data analytics
##

# Elasticsearch is a real-time, distributed storage, search, and analytics engine.
#brew 'elasticsearch'

# Logstash helps parse, enrich, transform, and buffer data from a variety of sources.
#brew 'logstash'

# Kibana is an open source analytics and visualization platform designed to work with Elasticsearch.
#brew 'kibana'

##
# Programming languages
#
# This section installs many programming languages:
# Clojure, Elixir, Erlang, Go, Haskell, Java, JavaScript,
# Perl, Python, R, Ruby, Scala, Swift, and tooling.
##

## Clojure

# Clojure programming language compiler.
#brew 'clojure'

# Leiningen automates Clojure projects.
#brew 'leiningen'

## Elixir

# Elixir programming language built on top of the Erlang VM.
#brew 'elixir'

## Erlang

# Erlang programming language for scalable high-availability systems.
#brew 'erlang'

## Go

# Go programming language by Google; compare `C`.
#brew 'go'

## Haskell

# Cabal is a package manager for Haskell
#brew 'ghc'
#brew 'cabal-install'

## Java

# Java programming language
# We prefer open source package 'openjdk' over Oracle cask 'java'
#brew 'openjdk'

# Gradle is a Java build tool
#brew 'gradle'

# Maven is a Java build tool
#brew 'maven'

# Jetty provides a Java web server and javax.servlet container
#brew 'jetty'

# Apache Tomcat implements Java Servlet and JavaServer Pages technologies.
#brew 'tomcat'

# Glassfish application server.
#brew 'glassfish'

# Android
#cask 'android-studio'
#cask 'android-file-transfer'
#cask 'android-messages'
#cask 'android-ndk'
#cask 'android-platform-tools'
#cask 'android-sdk'

## JavaScript

# Node.js is a JavaScript platform for building fast, scalable network app.
brew 'node'

# V8 JavaScript Engine.
brew 'v8'

# JSON output using the shell
brew 'jo'

# Package Managers
brew 'volta'
brew 'npm'
brew 'yarn'

# JID JSON explorer
tap 'simeji/jid'
brew 'jid'

## Lua

# Lua scripting language
#brew 'lua'

# Lua just-in-time compiler
#brew 'luajit'

## Perl

# Perl programming language, esp. for systems administration.
#brew 'perl'

# Perl-Compatible Regular Expressions pattern matching tools.
#brew 'pcre'

# CPAN search for perl modules
#brew 'cpansearch'

## Python

# Python programming language, esp. for systems scripting.
brew 'python'
brew 'python3'

# Python on the JVM
#brew 'jython'

## R

# R programming language, esp. for statistics. TODO: which R do we want?
#brew 'r'

## Ruby

# chruby changes the current Ruby.
#brew 'chruby'

# JRuby is a high performance, stable, fully threaded Java implementation of Ruby.
#brew 'jruby'

# Ruby programming language; compare `perl`, `python`.
#brew 'ruby'

# Tool to install various implementations of Ruby.
#brew 'ruby-install'

## Rust

# Rust programming language
#brew 'rust'

## Scala

# Scala programming language, that runs on top of the JVM.
#brew 'scala'

## iOS, Objective-C, Swift

# Alcatraz Xcode plugin manager
#cask 'alcatraz'

# Appium test automation framework
#cask 'appium'

# Carthage Xcode project dependency manager.
#brew 'carthage'

# Command-line application launcher for the iOS Simulator
#brew 'ios-sim'

# Tool to help with Swift style and conventions.
#brew 'swiftlint'

# SourceKitten attaches to SourceKit AST.
#brew 'sourcekitten'

## Tcl/Tk cross-platform toolkit
#brew 'tcl-tk'

##
# Programming processes
##

## Compilers

# GCC GNU Compiler Collection
brew 'gcc'

# LLVM compiler
brew 'llvm', args: ['with-toolchain']

## Continuous automation

# Jenkins open source automation server for continuous integration
#brew 'jenkins'

## Serializers

# Protocol buffers for serializing structured data; compare thrift.
#brew 'protobuf'
#brew 'protobuf-c'

##
# Platforms
##

# Azure by Microsoft
#brew 'azure-cli'

# Amazon Web Services (AWS) Command Line Interface (CLI)
brew 'awscli'

# Google Cloud Platform (GCP)
#brew 'gcloud'

# Heroku app hosting
#brew 'heroku'

## Virtual machines

# QEMU is a free and open-source emulator that performs hardware virtualization.
#brew 'qemu'

# VirtualBox creates and configures portable development environments, by Oracle.
#cask 'virtualbox'

# VMWare Fusion virutal machines
#cask 'vmware-fusion'

# Vagrant lightweight, reproducible, portable development environments
#cask 'vagrant'
#cask 'vagrant-manager'

## Provisioning

# Terraform common configuration to launch infrastructure.
#brew 'terraform'

## Configuration management

# Ansible is a simple way to automate apps and IT infrastructure.
#brew 'ansible'

## Containeriztion

# Docker assembles applications from components.
cask 'docker'

## Orchestration

# Kubernetes Solo cluster for macOS.
#cask 'kube-solo'

# Kubernetes command-line tool to run commands against Kubernetes clusters.
#brew 'kubectl'

# Run a single-node Kubernetes cluster in a virtual machine on your personal computer.
#brew 'minikube'

###########################################################################
#
# PAID SOFTWARE
#
###########################################################################

##
# This section installs software that costs money.
# In general, we aim to install free trial versions.
#
# We pay for licenses for this software for our teammates
# when we work on projects that use this software.
#
# You may want to customize this section by deleting any items that
# you don't want to use or purchase, because this will save disk space.
##

##
# JetBrains
#
# JetBrains is paid software suitable for professional programmers,
# such as Integrated Development Environments (IDEs) for popular
# programming languages, including Java, Python, Ruby, PHP, etc.
##

# AppCode Swift IDE
#cask 'appcode'

# CLion C/C++ IDE
#cask 'clion'

# DataGrip SQL IDE
#cask 'datagrip'

# IntelliJ Java IDE
cask 'intellij-idea'

# PhpStorm PHP IDE
#cask 'phpstorm'

# PyCharm Python IDE
#cask 'pycharm'

# RubyMine Ruby IDE
#cask 'rubymine'

# WebStorm IDE
#cask 'webstorm'

###########################################################################
#
# LIBRARIES
#
###########################################################################

##
# Libraries
#
# We do this near the end of this file,
# because we expect these will already be
# installed by a bunch of the software above.
#
# This section here is really just to cover our
# bases to make sure we have the libraries that we
# sometimes need for building other software later on.
##

# THe libevent API provides provides asynchronous event notification and callbacks.
brew 'libevent'

# Magic number recognition library for file types.
brew 'libmagic'

# Audio/Visual converters
brew 'libav'

# Curl web fetcher
#brew 'libcurl'  # EOL

# Foreign Function Interface Library
brew 'libffi'

# Text encoding
brew 'libiconv'

# File magic number recognizer
brew 'libmagic'

# Sodium secure cryptography
brew 'libsodium'

# GNU libtool is a generic library support script.
brew 'libtool'

# XML handlers
brew 'libxml2'
brew 'libxslt'

# High-level interface to X.509 and CMS (Cryptographic Message Syntax)
brew 'libksba'

# YAML markup language
brew 'libyaml'

# YAML lint validator
brew 'yamllint'

# Images
brew 'libjpg'
brew 'libpng'
brew 'libtiff'


###########################################################################
#
# FONTS
#
###########################################################################

##
# Fonts
#
# We like having lots of fonts.
#
# You may prefer to trim this list.
#
##

cask 'font-3270'
cask 'font-abeezee'
cask 'font-abel'
cask 'font-aboriginal-sans'
cask 'font-aboriginal-serif'
cask 'font-abril-fatface'
cask 'font-aclonica'
cask 'font-acme'
cask 'font-actor'
cask 'font-adamina'
cask 'font-adinatha-tamil-brahmi'
cask 'font-advent-pro'
cask 'font-african-sans'
cask 'font-african-serif'
cask 'font-aguafina-script'
cask 'font-ahuramzda'
cask 'font-aileron'
cask 'font-akronim'
cask 'font-aladin'
cask 'font-aldrich'
cask 'font-alef'
cask 'font-aleo'
cask 'font-alex-brush'
cask 'font-alfa-slab-one'
cask 'font-alice'
cask 'font-alike-angular'
cask 'font-alike'
cask 'font-allan'
cask 'font-allerta-stencil'
cask 'font-allerta'
cask 'font-allura'
cask 'font-almendra-display'
cask 'font-almendra-sc'
cask 'font-almendra'
cask 'font-amarante'
cask 'font-amaranth'
cask 'font-amatic-sc'
cask 'font-amethysta'
cask 'font-amiri'
cask 'font-anaheim'
cask 'font-andagii'
cask 'font-andale-mono'
cask 'font-andika'
cask 'font-angkor'
cask 'font-anka-coder'
cask 'font-annie-use-your-telescope'
cask 'font-anonymice-powerline'
cask 'font-anonymous-pro'
cask 'font-antic-didone'
cask 'font-antic-slab'
cask 'font-antic'
cask 'font-antinoou'
cask 'font-anton'
cask 'font-arapey'
cask 'font-arbutus-slab'
cask 'font-arbutus'
cask 'font-architects-daughter'
cask 'font-archivo-black'
cask 'font-archivo-narrow'
cask 'font-arial-black'
cask 'font-arial'
cask 'font-arimo'
cask 'font-arizonia'
cask 'font-armata'
cask 'font-artifika'
cask 'font-arvo'
cask 'font-asap'
cask 'font-asset'
cask 'font-astloch'
cask 'font-asul'
cask 'font-atomic-age'
cask 'font-aubrey'
cask 'font-audiowide'
cask 'font-autour-one'
cask 'font-average-sans'
cask 'font-average'
cask 'font-averia-gruesa-libre'
cask 'font-averia-libre'
cask 'font-averia-sans-libre'
cask 'font-averia-serif-libre'
cask 'font-awesome-terminal-fonts'
cask 'font-comic-neue'
cask 'font-comic-sans-ms'
cask 'font-coming-soon'
cask 'font-computer-modern'
cask 'font-gnu-unifont'
cask 'font-libre-baskerville'
cask 'font-libre-caslon-text'
cask 'font-libre-franklin'
cask 'font-mate-sc'
cask 'font-mate'
cask 'font-material-icons'
cask 'font-mononoki'
cask 'font-roboto-condensed'
cask 'font-roboto-mono-for-powerline'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-han-code-jp'
cask 'font-source-han-sans'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-space-mono'
cask 'font-terminus'
cask 'font-times-new-roman'
cask 'font-twitter-color-emoji'
cask 'font-ubuntu-mono-derivative-powerline'
cask 'font-ubuntu'
cask 'font-ultra'
cask 'font-verdana'
cask 'font-voltaire'
<<<<<<< HEAD
cask 'font-vt323'
cask 'font-waiting-for-the-sunrise'
cask 'font-wakor'
cask 'font-wallpoet'
cask 'font-walter-turncoat'
cask 'font-waltograph'
cask 'font-warnes'
cask 'font-webdings'
cask 'font-wellfleet'
cask 'font-wendy-one'
cask 'font-wenquanyi-micro-hei-lite'
cask 'font-wenquanyi-micro-hei'
cask 'font-wenquanyi-zen-hei'
cask 'font-wire-one'
cask 'font-work-sans'
cask 'font-xits'
cask 'font-yanone-kaffeesatz'
cask 'font-yellowtail'
cask 'font-yeseva-one'
cask 'font-yesteryear'
cask 'font-zeyada'
>>>>>>> c2fb172a1b0344dac1d88b8b3db9f193a01c2930
=======
>>>>>>> 7b9d35f48ce22a588732a553fcdbcf37b51189fe
