
# tap repositories and their packages

tap 'homebrew/core'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'awk'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'bcrypt'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'cjson'
brew 'cmocka'
brew 'curl'
brew 'dav1d'
brew 'diffstat'
brew 'diffutils'
brew 'docker-compose'
brew 'ed'
brew 'eg-examples'
brew 'erlang'
brew 'expect'
brew 'faac'
brew 'fd'
brew 'fdk-aac'
brew 'fetchmail'
brew 'ffmpeg'
brew 'ffmpeg2theora'
brew 'ffmpeg@4'
brew 'ffmpegthumbnailer'
brew 'file-formula'
brew 'flac'
brew 'flex'
brew 'flux'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fzf'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'ghostscript'
brew 'giflib'
brew 'git'
brew 'glib'
brew 'gmp'
brew 'gnu-units'
brew 'gnutls'
brew 'gobject-introspection'
brew 'gpatch'
brew 'gperf'
brew 'graphite2'
brew 'grep'
brew 'groff'
brew 'guile'
brew 'gzip'
brew 'harfbuzz'
brew 'heimdal'
brew 'highway'
brew 'howdoi'
brew 'icu4c'
brew 'imath'
brew 'isl'
brew 'jasper'
brew 'jbig2dec'
brew 'jid'
brew 'jo'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'krb5'
brew 'lame'
brew 'lapack'
brew 'ldns'
brew 'leptonica'
brew 'less'
brew 'libarchive'
brew 'libass'
brew 'libav'
brew 'libavif'
brew 'libb2'
brew 'libbluray'
brew 'libcbor'
brew 'libedit'
brew 'libevent'
brew 'libexif'
brew 'libffi'
brew 'libfido2'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libgphoto2'
brew 'libiconv'
brew 'libidn'
brew 'libidn2'
brew 'libkate'
brew 'libksba'
brew 'libmagic'
brew 'libmpc'
brew 'libnghttp2'
brew 'libogg'
brew 'libpcap'
brew 'libpng'
brew 'libpthread-stubs'
brew 'librist'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libusb-compat'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxml2'
brew 'libxrender'
brew 'libxslt'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'lmdb'
brew 'lsof'
brew 'lua'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'make'
brew 'mas'
brew 'mbedtls'
brew 'mosh'
brew 'most'
brew 'mpdecimal'
brew 'mpfr'
brew 'nano'
brew 'navi'
brew 'ncurses'
brew 'netpbm'
brew 'nettle'
brew 'node'
brew 'oniguruma'
brew 'opencore-amr'
brew 'openexr'
brew 'openjpeg'
brew 'openldap'
brew 'openssh'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'opus'
brew 'p11-kit'
brew 'pandoc'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pixman'
brew 'pkg-config'
brew 'pnpm'
brew 'protobuf'
brew 'psutils'
brew 'python@3.10'
brew 'python@3.9'
brew 'pyyaml'
brew 'rav1e'
brew 'readline'
brew 'ripgrep'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 's-lang'
brew 'sccache'
brew 'scrypt'
brew 'sdl12-compat'
brew 'sdl2'
brew 'six'
brew 'slides'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'subversion'
brew 'tcl-tk'
brew 'tcpdump'
brew 'tesseract'
brew 'texi2html'
brew 'theora'
brew 'tldr'
brew 'uchardet'
brew 'unar'
brew 'unbound'
brew 'unzip'
brew 'utf8proc'
brew 'v8'
brew 'vim'
brew 'volta'
brew 'webp'
brew 'wget'
brew 'whois'
brew 'wxwidgets'
brew 'x264'
brew 'x265'
brew 'xorgproto'
brew 'xsv'
brew 'xvid'
brew 'xz'
brew 'yamllint'
brew 'yarn'
brew 'yasm'
brew 'yq'
brew 'zeromq'
brew 'zimg'
brew 'zlib'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-fast-syntax-highlighting'
brew 'zstd'

tap 'homebrew/bundle'

tap 'homebrew/cask-drivers'

tap 'homebrew/cask-fonts'
cask 'font-3270'
cask 'font-abeezee'
cask 'font-abel'
cask 'font-aboriginal-sans'
cask 'font-aboriginal-serif'
cask 'font-abril-fatface'
cask 'font-aclonica'
cask 'font-acme'
cask 'font-actor'
cask 'font-adamina'
cask 'font-adinatha-tamil-brahmi'
cask 'font-advent-pro'
cask 'font-african-sans'
cask 'font-african-serif'
cask 'font-aguafina-script'
cask 'font-ahuramzda'
cask 'font-aileron'
cask 'font-akronim'
cask 'font-aladin'
cask 'font-aldrich'
cask 'font-alef'
cask 'font-aleo'
cask 'font-alex-brush'
cask 'font-alfa-slab-one'
cask 'font-alice'
cask 'font-alike'
cask 'font-alike-angular'
cask 'font-allan'
cask 'font-allerta'
cask 'font-allerta-stencil'
cask 'font-allura'
cask 'font-almendra'
cask 'font-almendra-display'
cask 'font-almendra-sc'
cask 'font-amarante'
cask 'font-amaranth'
cask 'font-amatic-sc'
cask 'font-amethysta'
cask 'font-anaheim'
cask 'font-andagii'
cask 'font-andale-mono'
cask 'font-andika'
cask 'font-angkor'
cask 'font-anka-coder'
cask 'font-annie-use-your-telescope'
cask 'font-anonymice-powerline'
cask 'font-anonymous-pro'
cask 'font-antic'
cask 'font-antic-didone'
cask 'font-antic-slab'
cask 'font-antinoou'
cask 'font-anton'
cask 'font-arapey'
cask 'font-arbutus'
cask 'font-arbutus-slab'
cask 'font-architects-daughter'
cask 'font-archivo-black'
cask 'font-archivo-narrow'
cask 'font-arial'
cask 'font-arial-black'
cask 'font-arimo'
cask 'font-arizonia'
cask 'font-armata'
cask 'font-artifika'
cask 'font-arvo'
cask 'font-asap'
cask 'font-asset'
cask 'font-astloch'
cask 'font-asul'
cask 'font-atomic-age'
cask 'font-aubrey'
cask 'font-audiowide'
cask 'font-autour-one'
cask 'font-average'
cask 'font-average-sans'
cask 'font-averia-gruesa-libre'
cask 'font-averia-libre'
cask 'font-averia-sans-libre'
cask 'font-averia-serif-libre'
cask 'font-awesome-terminal-fonts'
cask 'font-bad-script'
cask 'font-baloo'
cask 'font-balthazar'
cask 'font-bangers'
cask 'font-comic-neue'
cask 'font-comic-sans-ms'
cask 'font-coming-soon'
cask 'font-computer-modern'
cask 'font-gnu-unifont'
cask 'font-hack-nerd-font'
cask 'font-libre-baskerville'
cask 'font-libre-caslon-text'
cask 'font-libre-franklin'
cask 'font-mate'
cask 'font-mate-sc'
cask 'font-material-icons'
cask 'font-mononoki'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-space-mono'
cask 'font-terminus'
cask 'font-times-new-roman'
cask 'font-twitter-color-emoji'
cask 'font-ubuntu'
cask 'font-ubuntu-mono-derivative-powerline'
cask 'font-ultra'
cask 'font-verdana'
cask 'font-voltaire'
cask 'font-vt323'
cask 'font-waiting-for-the-sunrise'

tap 'homebrew/cask-versions'
cask 'firefox-developer-edition'

tap 'homebrew/services'

tap 'homebrew/cask'
cask 'alfred'
cask 'anydesk'
cask 'appcleaner'
cask 'atom'
cask 'audio-hijack'
cask 'bitwarden'
cask 'canva'
cask 'discord'
cask 'docker'
cask 'duckduckgo'
cask 'firefox'
cask 'flux'
cask 'gifox'
cask 'gimp'
cask 'google-chrome'
cask 'google-drive'
cask 'intellij-idea'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'keybase'
cask 'kindle'
cask 'libreoffice'
cask 'lunasea'
cask 'macdown'
cask 'mactex'
cask 'mark-text'
cask 'microsoft-auto-update'
cask 'microsoft-office'
cask 'obs'
cask 'obs-websocket'
cask 'pycharm'
cask 'rectangle'
cask 'shotcut'
cask 'sublime-text'
cask 'syncthing'
cask 'tad'
cask 'texshop'
cask 'touch-portal'
cask 'tunnelblick'
cask 'vb-cable'
cask 'vlc'
cask 'wireshark-chmodbpf'
cask 'ytmdesktop-youtube-music'

tap 'denisidoro/tools'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'romkatv/powerlevel10k'
brew 'powerlevel10k'

tap 'simeji/jid'

# App Store applications
mas 'Bitwarden (2022.10.1)', id: 1352778147
mas 'Final Cut Pro (10.6.5)', id: 424389933
mas 'GarageBand (10.4.7)', id: 682658836
mas 'iMovie (10.3.5)', id: 408981434
mas 'Keynote (12.2)', id: 409183694
mas 'Numbers (12.2)', id: 409203825
mas 'Pages (12.2)', id: 409201541
